<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Blender. (At least) Since v2.93 you may choose between x64 and arm64 as architecture. This recipes defaults to x64.</string>
	<key>Identifier</key>
	<string>io.github.hjuutilainen.download.Blender</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Blender</string>
		<key>ARCHITECTURE</key>
		<string>x64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Comment</key>
			<string>Get a link to a release page</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.blender.org/release/</string>
				<key>re_pattern</key>
				<string>(?s)(Blender(\d+\.\d+)/)(?!.*(Blender(\d+\.\d+)/))</string>
			</dict>
		</dict>
		<dict>
			<key>Comment</key>
			<string>Get the dmg download URL from the release page. Adapted from https://github.com/autopkg/NickETH-recipes/blob/master/Blender/Blender-Win64.download.recipe.yaml</string>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>URL_INTER</key>
				<string>https://download.blender.org/release/%match%</string>
				<key>url</key>
				<string>https://download.blender.org/release/%match%</string>
				<key>re_pattern</key>
				<string>(?s)(blender-(?P&lt;version&gt;\d+\.\d+\.\d+)-macos-%ARCHITECTURE%.dmg)(?!.*(blender-(\d+\.\d+\.\d+)-macos-%ARCHITECTURE%.dmg))</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%ARCHITECTURE%.dmg</string>
				<key>url</key>
				<string>%URL_INTER%%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/Blender.app</string>
				<key>requirement</key>
				<string>identifier "org.blenderfoundation.blender" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "68UA947AUU"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
